"""მომხმარებელს შეეკითხეთ საწყისი და საბოლოო რიცხვები. 
ეს რიცხვები გადაეცით ფუნქციას, for ციკლით სიაში შეინახეთ მათ შორის არსებული რიცხვები. 
შემდეგ მოახდინეთ გაფილტვრა, ისევ for ციკლით განიხილეთ თითოეული რიცხვი - თუ რიცხვი ლუწი იქნება,
 ახალ სიაში დაამატეთ მისი მეორე ხარისხი, ხოლო თუ 
კენტი იქნება სიაში დაამატეთ მისი კვადრატული ფესვი (0.5 ხარისხი)."""

def func(first, last):
    list = []
    for i in range(first, last):
        if i % 2 == 0:
            list.append(i**2)
        else:
            list.append(i**0.5)
    return list

print(func(1, 25))

